Revit 2027 API
Polyloop Methods
The Polyloop type exposes the following members.
Methods
Name | Description
ComputeArea |  Gets the area for this polygon.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetPoints |  Gets the array of points in the polygon.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Polyloop Class
Autodesk.Revit.DB.Analysis Namespace